Revit 2027 API
StairsUndersideSurfaceStyle Enumeration
 The style of the underside surface of the run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsUndersideSurfaceStyle
Public Enumeration StairsUndersideSurfaceStyle
public enum class StairsUndersideSurfaceStyle
type StairsUndersideSurfaceStyle
Members
Member name | Value | Description
Smooth | 1 |  The underside surface of the run is smooth.
Stepped | 0 |  The underside surface of the run is stepped.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace